{"columns":["Area","Date/Time \nMon-DD HH:MM","Status","Info on Electricity/Phone","Dry Areas","Areas with some water stagnation","Source"],"rows":[["ABHIRAMAPURAM/ALWARPET","Dec-05 20:31","Seethammal Road in Alwarpet (off Ethiraj Kalyana Mandapam) still waterlogged. 3rd Dec 5:30 am - Water logging. people at around level have moved to higher levels.Animal rescue at Sankara hall.","","","",""],["ALWARTHIRUNAGAR","Dec-06 13:00","Raining in Alwarthirunagar. No signals for airtel,vodafone and internet. Tata docomo is working. Pwer,food,water, milk available","No Power","Nakeeran St"," mega mart area, Arcot road",""],["ADYAR","Dec-04 19:30","Gandhinagar Area: 4rd Dec, 7:30 pm - Heavy rains earlier have eased, BSNL landlines starting to work, most roads passable, Vodafone works.\nDec 3rd, 11PM: \nIIT - all reported safe, RJ Balaji. Water logging manageable.\nKarpagam Gardens -no water clogging, just no power and phone connectivity. \nDec 5, 9:30 pm: Padmanabha Nagar - Power back though will be in shifts, milk, water available","7:30PM : Intermittent Power supply \nBSNL Landlines beginning to work\n9:30 pm: Power back in shifts, bad cell signal","","",""],["ADAMBAKKAM","Dec-05 17:00","Some parts of Adambakkam like Balaji Nagar 13th street have power now. Update as of 5 pm IST\nWater has started receding from Mount Subway and nearing areas. ","","","",""],["AIRPORT","Dec-05 13:30","Terminal still not ready to take passengers","","","",""],["ALAPAKKAM-MADURAVOYAL ROAD","Dec-05 14:10","Area ok but still no power, no network. Roads are blocked and no easy way to go anywhere. So everyone just staying in-house.","No power, no phone ","","",""],["ANNA NAGAR/MOGAPPAIR","Dec-04 09:30","Route from Anna Nagar to Koyambedu - No water. \nDec 3rd, 4:30 PM\nElectricity and phone connectivity appear to be restoring based on first hand info.\nShanthi Colony, 2 ave flooded. 1st ave is mostly dry (03/12 morning)\nsource: https://twitter.com/jananevenk/status/672235563630505984\n3rd Dec, 3 PM - West TNEB providing 2 hrs of electricity ","Power restored. ","Park road navigable.\nAnna Nagar West Extn - Dry","",""],["ANGAPUTHUR","Dec-04 09:30","Water receded in vekateshwara nagar area.","","","",""],["ASHOK NAGAR","Dec-06 09:00","Dec 5th, 9 amAvenue 9,18 are the ones which are affected quite badly. No current, No network, water logging till knee. Managed to talk to few ppl and they said provisions and foods are already there with them. Need to go to Avenue 16 and 18 tomorrow. All the others places are completely fine with very minimal water loggings and current is disconnected just as precautionary measure.Ashok Nagar Metro station is open, trains running\n\nDec 4th, 09:15, 2nd avenue - Shops open, groceries available, bread not available. \nThis group has a lot of info with pics on Ashok nagar\nhttps://www.facebook.com/groups/1665501917064029/?fref=ts","Dec 6th 9 am, BSNL Landline and Airtel Cell service are up\n\nPower restored","Main Roads - 2nd, 3rd, 4th, 7th, 8th, 10th, 11th and 12th avenues, Areas around Pillar, Jawahar Vidyalaya, Papa Johns, CCD, McDonald's, 54th street near govt girls school. ","(less than 8 - 10 inches) Area near Hot Chips,  Roads off 7th ave such as 23rd, 27th, 28th, 46th, 49th streets , 18th avenue.\nWater Receding - PT Rajan Salai, 4th Avenue ",""],["AVADI","Dec-03 19:00","On ground update - No water. Power available though, but networks down.","","","",""],["BESANT NAGAR","Dec-03 11:00","2 nd cross. Customs colony safe. No basic supplies.\nBesant nagar approach through theosophical society road. All other routes have been inundated.\n","No power n mobile","","",""],["CAMP ROAD","Dec-03 05:00","Immediate to the camproad junction area, very little rain over past 12 hours. No water logging around Rajeshwari Nagar, camproad junction. ","power restored. landlines still dead.","","",""],["CHETPET","Dec-03 23:00","Roads are manageable & a few bakeries, pharmacies are open ","Electricity available. ","","",""],["CHOOLAIMEDU","Dec-04 02:00","2-3 ft water","power not restored, vodafone working, aircel reachable","","",""],["CHROMEPET","Dec-04 09:00","sundarthammal colony purushotham nagar chromepet - Chromepet area absolutely no water logging","","Chromepet area absolutely no water logging","",""],["CIT Nagar","Dec-04 08:00","Water logging receding from 3-4ft to below knee level\nDec 4, 7:15 am IST rescue available. food being distributed.\nDec 4th 4:29AM IST: Spoke to someone who answered the phones in Commissioner's office who was very patient but at the same time very generic and didn't want to get into specifics. I inquired about KK Nagar, CIT Nagar and Thoraipakkam. He said that the water level has come down drastically in the past few hours in these areas and asked not to panic if they are not accessible via phone. Everyone in these areas have been offered food and there is no power or phone line connection yet.\n","No power yet","","Water logging receding from 3-4ft to below knee level",""],["ECR","Dec-04 12:00","Most people have been evacuated or moved to higher floors in interior lanes of anna enclave, bethel nagar vettuvankeni, neelangarai, kottivakam,palavakkam on the other side of ecr road (left side while going towards the city), Iscon temple areas too. Still not safe to venture into. ","","Other side of road from what is mentioned in 'Status' and interior lanes- dry and safe","",""],["EKKATUTHANGAL","Dec-03 23:00","Kasi theatre bridge is motorable\n3rd Dec, 3PM IST - Defence Colony  - Near Kasi theatre. Personnel evacuated to Military Hospital/ Water levels still around 2.5 FT but receding.","","","",""],["EGMORE","Dec-04 09:00","Water is draining. Around 2 feet of water only. No rains last night\nMontieth road, Dec 3rd, 8.47pm: Thigh high water. Pazhamudir cholai open with no milk, bread and vegetables\\","Power available in some areas","Water is draining. Around 2 feet of water only. No rains last night","",""],["GUDUVANCHERI","12/6/2015 1:00 pm ","Palavathangal subway clear. No water logging anywhere. Moderate traffic on GST road","","","",""],["GUINDY","Dec-05 09:30","Race view colony 2nd street area ( near race course) \nsporadic signal and no power yet and no water logging area guindy","","","",""],["GERUMBAKKAM","","","","","",""],["JAFFERKHANPET","Dec - 06 02:00","Overall there is improvement in all these areas in terms of the reduction in the water level. (Less than 1 feet) - - Thamizharasan Karunakaran","","","",""],["JAFFERKHANPET","Dec-05 11:00","Jafferkanpet/Kasi theatre : Nil water stagnation in the main roads and negligible water stagnation in the side roads. I could verify upto 2/3 streets in the sides of the arterial roads.Kasi theatre bridge which was reportedly shaking is absolutely safe & vehicles moving.","","","",""],["JAFFERKHANPET","Dec-05 07:15","The water has drained in and around gangai Amman koil street, able to get out of the house and go around.  Situation is much better guys, just ask your family to stock up in good water and stay put for next 5-6 days till all the rain subsides.","No Power. Only bsnl mobile and landlines seem to work.  We got other aircell airtel mobile landlines that just would not work.","","",""],["JAFFERKHANPET","Dec-03 20:30","BOATS AND NDRF IN OPERATION\nWater levels receding. Many people in the area with rescue operations, but while it is slow, good news is water levels are slowly going down.\nOkay at 3rd Dec, 2:45 pm - Water level going down slowly. Some areas are still being evacuated.","","","",""],["KILPAUK","Dec-03 21:45","Water Stagnation in New Avadi road and Water tank road.","Power available. ","","",""],["KKNAGAR","Dec-04 09:50","Dec 4, 9:50 PM - Due to today's rain there is water logging (knee level) near Double tank in R.K.Shanmugam salai. Water drained out in other areas ESI, Sivan Park, Anna main road etc.\nDry Areas : Barathidasan colony\nSome water (<8-10inches) :  mgr nagar, 9th sector.\nWater Receding :  PT Rajan\nWater logged : Lakshmanasamy,Rajamannar and Ramasamy sectors (near Pullaiyar kovil)\nDec 4th 10:00am -- PT Rajan -shops closed- no supplies \nDec 4th 7:11 AM - Electricity is back up in K.K.Nagar, but Airtel internet isn't working as of 7AM IST. Cellular signal is spotty. Domestic calls don't go through, but international calls do.\nDec 4 - 3:55 AM - -Power is restored and water levels are low. Most phone lines are still down, so please don't panic if you're unable to reach people in this area.\nDec 4 - 3:48 AM West KKNagar near Vembuliamman kovil is safe now. Control room numbers: 25615025, 25619246\nMLM super market ran out of stock\n","Power is back in some places/low network","Barathidasan colony,mgr nagar, 9th sector(very little water)","Lakshmanasamy,Rajamannar and Ramasamy sectors (near Pullaiyar kovil)",""],["KODAMBAKKAM","Dec-05 14:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686356188244972/\nDec 4th- 10:15am: Water receded and power back at Ganga Nagar near Power House, opposite to BSNL office,\nDec 4th  9:31am : Water receded from Railway Station area. Power and phone lines restored.\nDec 4th - 5:00 am: Water is completely drained on Arcot road from sekar emporium till pizza hut near Aavichi school. Roads are very bad but we can travel. Shops are all open.\nDec 5 2:00 pm: Largely water free","Power and phone lines restored in some places. Current has been restored at R.K.Shanmugam salai, K.K. Nagar. Landline started working (only the series starting with 2366.. is working and other series not working as of now).","Ganga Nagar near Power House, Railway Station Area, Arcot road from sekar emporium till pizza hut near Aavichi schoo","",""],["KOLAPAKKAM","","https://www.facebook.com/groups/ChennaiFloods/permalink/1686342204913037/\nAs of latest reports, still pretty heavily inundated. People are ok if staying indoors.\n\n","","","",""],["KOLATHUR","Dec-03 23:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686357928244798/\nDEc 3 11:43 pm:  Ankle-deep water, power restored, limited mobile coverage\n","Power restored/limited network","","",""],["KOTHARI NAGAR","Dec-04 12:15","Dec 4th 12:15pm - Kothari Nagar safe - provisions also available. but no power and network \n","No power/network","","",""],["KOTTURPURAM","Dec-04 14:00","Dec 4th - 11 AM - Bridge still closed\nDec 4th 9:30am - DP nagar 1st and 2nd streets (which were really bad) , waters have receded significantly. Traffic is still not allowed to go in there, but people are doing well and are soon expected to be able to get out of there without boats.\nDec 3rd 11:15pm IST - Water level has receded in Kotturpuram and authorities have moved in to rescue and help..\nDec 5, 2 pm: not allowed on bridge - kottur market area accessible from anna university side - largely water free","","","",""],["KOYAMBEDU","Dec-04 12:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686334451580479/\n4th Dec, 12noon - Bone dry. Main roads are ok, side lanes are flooded and but they pumping out water onto the main roads, so road opposite koyambedu slight water logging\n3rd dec 11:15pm - ‪Koyambedu‬. Buses are available.","","","",""],["KOVILAMBAKKAM","Dec-03 15:45","Dec 3rd 3:45pm: Rajam Nagar Main Road, near Narayanpuram lake - water has mostly receded in quite few areas.possible to drive. Power appears to be back but there is no network coverage in the area still.\nLast spoke to my brother at 9:30PM IST on 02/12/2015. Water logging is low- moderate. Some places have electricity. Will again update information for this location at 06:00AM IST. (This status was updated at 03:54AM IST - 03/12/2015).\nAlso heard Keelkattalai signal junction is heavily flooded.\n","Power back in some areas/no network","","Keelkattalai","First hand info"],["MADIPAKKAM","Dec-04 20:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686470614900196/ \nDec 4th, 8 PM- No power no water logging, from kelkattalai to madipakkam all fine. From sadasiva nagar going forward till velachery issues due to water stagnation\nDec 4th, 11am - water level is 5 to 7 feet there but everyone is safe no need to worry they have also provided food n water supply\nDec 4 - 10AM - karthikeyapuram, madipakkam, all is well there, water is well receding, landline now working like a charm..still no power, drinking water still a problem.\nDec 4 - 9 AM Power supply not available so they may not be able to charge their mobiles...pls.wait till its up. Don't worry things are safe in those areas..\n4th DEC, 3:14 AM - GM hospital , ponniamman kovil current restored and clear sky with stars reported.\n","some areas power restored\nNo network, connections to Land Line \nphones working after multiple tries","Karthikeyapuram","KK Nagar",""],["MANAPAKKAM","Dec-04 06:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686292604917997/\nDec 4th - 6AM - Spoken 1st hand report - spoke to my Family in marvel Riverview county. According to them all fine. No power and very low connectivity but everything else fine. They are in first phase - Manapakkam.\nDec 3rd 4PM Manapakkam area,  people were able to reach the main road for supplies, water stagnation has receded ","No power, low network ","","",""],["MANDAVELLI","Dec-04 00:00","Bone Dry Power Back","Power is back","","",""],["MANGADU","Dec-04 19:00","Dec 3rd, 7PM - on ground update - most areas seem safe, no water.\n","","","","First hand info"],["METTUKUPPAM(600097)","Dec-03 05:05","Dec 3rd  5:05AM  :Secretariat colony Water level is still 10ft , No electricity people are still waiting for boats to get rescued.\n","No electricity","","",""],["MRC NAGAR","Dec-03 19:00","Dec 3rd, 7PM - on ground update - Still heavily waterlogged\n","","","","First hand info"],["MUGALIVAKKAM","Dec-03 15:50","Dec 3rd, 3:50 PM: annai velankanni nagar :Water had been receding, very little water logging. Milk and water supplies were scarce and expensive when available. No electricity in the area and mobile network's were being received only from terraces of buildings.\n","No power. Mobile networks only on terraces","","",""],["MYLAPORE","Dec-04 08:50","Road clear from anna nagar to koyambedu. milk and groceries available. shops open. power back.\nKamadhenu - Luz, RK Salai and Woodlands Petrol Stations are operational","Power is back","","",""],["MEDAVAKKAM","Dec-04 14:15","Roads are clear. Power is back ,internet and phone signal are available in some parts","Power, Phone and internet available in some parts","","","https://www.facebook.com/groups/ChennaiFloods/permalink/1686275408253050/"],["NANDAMBAKKAM","","Most people in Wood Creek county safe and in their homes. \nRescuers were there to check on and evacuate as needed","No power or cell phone reception.","","",""],["NANDANAM","Dec-04 14:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686520624895195/\nelectricity/power is back up around 9.00 PM IST.. It did rain heaily between 2 and 6 PM but that has no effect on the situation.\nChamiers Road - Knee high water. Venkateshwara hospital open. Shops closed. \n Nandanam signal to West mambalam - Water below knee-level. Groceries, \nTea shops and Medical shops OPEN. \n5:30 PM Chamiers Road, 5th Main Road through Lotus Colony dry and motorable.\nDec 5, 2 pm - Main Roads largely water free","No power or cell phone reception.\nWorking Bsnl Landlines","","",""],["NANGANALLUR","Dec-04 11:15","Dec 4th, 11.15am IST - MGR Road,AGS Clny,Modern School - no water.Power was available sometime back. Shops open.\nNO Flooding streets/Main rd in Nanganallur, Ramnagar Lakshmi Nagar, Hindu, Nehru colony.\nPower has resumed in 6th main road. No water logging in major parts of Nanganallur. Source\nThillaiganga Nagar - No major waterlogging, power restored, airtel is working on and off but other networks are down\n","","","",""],["NATESAN NAGAR","Dec-03 23:55","Dec 3rd - 11:55PM - PM No water on Natesan Nagar 3rd street and Main Road. ","Area has power too.","","",""],["NEELANKARAI","Dec-03 19:00","3rd Dec, 7PM IST - On ground update - no water logging, limited power available.","","","",""],["NESAPAKKAM","Dec-05 05:00","my friend spoke to her parents in k k ponnuragam salai, they said there is very lil water of 1-2ft around banyan tree and ganesha temple..the megamart area is still blocked...the water has resided alot,where it was flooded too..\nOnly waterlogged in small pockets but everything is manageable around,people are going to get supplies and stuff on their own..\nThough many people had to be taken in d car n dropped. But he said they could go till kk nagar without any problems using alternative routes..\nMilk was also supplied by Avin yest mornin around that area..Nothing much to worry about in and around\nnessapakkam!!sakthi nagar nesapakkam is fine","","","",""],["NUNGAMBAKKAM","Dec-03 23:15","3/12/15 - 11:15PM IST - Loyola college subway waterlogged is fully drained. Nungambakkam roads, Express avenue roads are good to go. \n3/12/15, 11pm IST - Uthamar Gandhi salai- Sterling road stretch water free. Power restored, Supermarkets open.\n\n","","","",""],["PALLAVARAM","Dec-04 18:30","Dec 4, 6:30 am IST: Route on dargah road is cleared .Power has been up for the last 12+ hours . Bsnl landlines don't work . Airtel and Vodafone call works occasionally from elevated areas (3+ floors up) \nUpdate from 6:45 am Dec 3rd; Airtel network is working, power available intermittently in Zameen Pallavaram","","","","First hand info"],["PALLIKARNAI","Dec-03 20:00","Dec 3rd, 8pm - Kamakshi hospital intersection blocked. Road leading to Kizhkattalai bus stand from 200 ft road is partially blocked as well\n2:20pm IST DEC 3rd: Pallikarnai blocked beyond Narayanapuram\n","","","",""],["PERAMBUR","Dec-04 08:00","Dec 4 - 8 AM - Mobile connectivity decent, with some buses operational.","","","",""],["PERUNGALATHUR","Dec-04 08:00","Dec 4th - Captain Sasi Kumar nagar free of water logging.","","","",""],["PERUNGUDI/KANDANCHAVADI","Dec-04 13:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686516234895634/\nDec 4th 12:00 AM - No water logging\nDec 4th 1:00pm - Kurinchi Nagar - Safe ; Elimnagar SP Infocity- no water logging, water and food available\nMGR Main road in Kandanchavadi is clear at least from Apollo Hospital till SP Infocity/ Thanthi TV building. CBI Colony Main road and whereabouts also seem clear. No power backup.","","","",""],["POLICHALUR","Dec-04 04:30","Dec 4th 4:30 am - Water receding close to Polichalur Govt Hospital Area","","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-05 14:00","Dec 4, 8:30 am:  Ambal nagar porur. No mobile or telephone connectivity but conditions ok.\nDec 4, 6:00 am IST - Porur Arcot Road, by pass road in perfect condition, porur junction messy yet navigable, MIOT hospital are blocked off, Porur to Guindy very poor route, SRMC college working 100%, poor cell connectivity\nDec 5, 2:00 pm IST - Main roads water free in Poonamalee                                                                                                                                                                                           Dec 6, 1:00 PM- Rains stopped, MTC running now","","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-03 23:15","Dec 3rd - 11:15pm IST - ‪#‎Poonamalle‬ High road is safe and operational.","","","",""],["RAMAPURAM","Dec-04 12:15","Dec 4th 12:15pm - Kothari Nagar safe - provisions also available. but no power and network \nDec 3rd 5:15pm - Situation is that certain houses in ground floor have water.Except for no current and no mobile or landline..things are a bit safe as of now. \nDec 3rd 2:15pm - Water receding and supplies being provided\n","","","",""],["RA PURAM","Dec-03 23:19","Dec 3rd 11:19pm -  Home center water receded. Billroth hospital still has power outrages and water logging.\nDec 3rd 4:45pm - TTK Road signal to RA Puram: no problem, but a bit of water logging near Billroth Hospital.\nhttps://www.facebook.com/singam.90?fref=ts says water receding slowly (8AM 03/12)\n","","","",""],["RK Salai","Dec-03 13:32","Update at 1:32 PM IST, Dec 3rd - Commutable roads, Power supply back.\n Food and water situation ok.","","","",""],["ROYAPETTAH","Dec-03 19:00","Dec 3rd, 7PM - on ground update - water is decreasing, power is available in most areas, but limited network\n","","","",""],["SAIDAPET","Dec-05 20:00","3rd Dec - 10PM IST - A good news from our team members Naveen Kumar and Others members from Saidapet is that, Water in Johns Road,Saidapet has drained and vehicles are moving now and In west saidapet Water level is reduced to 41/2 ft and still continues decreasing.Water is exiting through aranganathan Subway in saidapet.\n3rd Dec - 9.30 pm - Saidapet is accessible now. vehicles can move.\n3rd Dec, 7:30 p.m.: 3)  water level receding now near Jones Road. BSNL network is still down, Airtel works. No power for 36 hours\nThis group has info with pics about saidapet \nhttps://www.facebook.com/groups/187146518294944/?fref=ts\nDec 5 2pm: completely water free - the slums near the river banks (below the bridge) are still affected - traffic plying as usual\nDec 5 8pm: Aatu thotti bridge open for 2 for way traffic, commuting not very safe yet, guidy side is not good, subways closed.","","","",""],["SALIGRAMAM","Dec-04 02:00","Dec 4th 2:00AM IST - No water in Saligramam. \nWater level around 1-2 ft in satyamoorthy street devraj, near prasad lab and arunachalam road, water level has reduced.power not yet restored. bread packets and milk packets are being distributed. \nDec 3rd, 2:45 PM : Arcot road: water clogging - being in first floor is safe\n","","","",""],["SANTHOME","Dec-05 08:30","Report from person on Santhome high road, some patches of water, but definitely motorable - 8.30AM IST.\n","","","",""],["SHASTRI NAGAR","Dec-03 11:30","Updated at 11.30 am IST, December 3rd - Direct report from cousin - Shastri nagar, 8th cross. That water levels are coming down. People are largely indoors and safe on thus street.\n","","","",""],["SHOLINGANALLUR","Dec-04 10:00","Dec 4th - 10AM IST - on ground info - from Chennairains twitter - Sholinganallur Kumaraswamy Nagar has power restored. Internet and network is slow. ECR seems to be clearing up for travel.\n5:18PM DLF Gardens: gensets in basement flooded, no diesel. Dec 5th- 8.30 AM- Pudunagar water logging","No power as ","","",""],["TAMBARAM","Dec-04 08:00","Dec 4th 08:00AM - Water is draining in Mudichur and Tambaram areas, now only 2 to 3 feet water in mudichur that too for short stretches, power came in most of the areas. No worries and not need to panic about tambaram area.\nEast tambaram area update near rajakilpakkam: Dec 4, 630 am, no rains since yesterday. Just intermittent showers. Landlines and mobiles not working for most of us but a few numbers get connected occasionally. No flooding.\nDec 4th 1:14am - West Tambaram - Water levels are receding, and power has been restored a few hours back.\nDec 6th 8.30 am- West Tambaram- No rains, water logging in some streets, rest drained out. Water logging in following areas of Mudichur: CTO Colony,Krishna Nagar and roads going into interior Mudichur.","","","",""],["T.NAGAR","Dec-05 14:15","Dec 3rd, 22:00: Water in area has completey drained.\nDec 3rd 20:30: Venkatraman street - water levels is very less. Landlines and BSNL numbers are working intermittently\nDec 4th 21:00 IST : Internet is back on in some parts around Pondy Bazar, electricity and phone lines working. Heavy rains started again, but no signs of flooding yet\nDec 5 2:00 pm - N. Usman Road: ankle length water , enough to commute vehicles in most parts, Burkit rd - water free roads","","","",""],["TEYNAMPET","Dec-03 23:19","Dec3, 2015 23:19  - Cenotaph flyover signal has completely receded and can be easily accessed","","","",""],["THIRUVANMIYUR","Dec-04 08:00","Dec 4th ~8:00AM - Thiruvanmiyur signal to tidel some flooding ","","","",""],["THORAIPAKKAM","Dec-04 05:30","4th Dec, 5.30 AM - Water is at 2 ft. NDRF is working on this area.Situation seems to be improving overall.\n","","","",""],["TIDEL_PARK AREA","Dec-06 11:00","Tidel park is not waterlogged. Buses and people moving around","","","",""],["THIRUVANMIYUR","Dec-04 08:00","Thiruvanmiyur signal to tidel some flooding, 2-3 ft water.","","","",""],["TRIPLICANE","","","","","",""],["URAPAKKAM","Dec-04 13:30","Water has drained away i nthe arul Nagar - Neelan school area","BSNL Lines not working; Power is back.","","",""],["VADAPALANI","Dec-05 04:00"," No water loggings at all from main roads to kodambakkam bridge. Few places around ambedkar statue has water loggings. People manage to walk out of there houses and make calls. Few houses even has current.Dec 4th, 8.40 am: Traffic seen on 100ft Road \nDec 4th, 5:00 am: 100ft road till hotel bheemas was clear of water.MTC Buses functioning even from vadapalani bus depot saw 27C, 12B and buses towards Porur. None of the mobile towers work from vadapalani till porur\n","","","",""],["VALASARAVAKKAM","Dec - 06 02:00","few places like ‪#‎TNagar‬ GN Chetty Road, ‪#‎Valasaravakkam‬ and ‪#‎Virugambakkam‬ (in front of ‪#‎ChandraMetroMall‬ still have water log upto 1 to 2 feet. Virugambakkam and Valasaravakkam have very bad road conditions and heavy traffic due to broken roads and water log.","Still no power in these areas.","","Road adjacent to Valasaravakkam Mega mart has been blocked due to heavy water log.","Thamizharasan Karunakaran"],["VALASARAVAKKAM","Dec-05 03:45","https://www.facebook.com/groups/ChennaiFloods/permalink/1686556258224965/\nDec 5th 3:45 AM : VALASARAVAKKAM BSNL tower just came back on. Dad had residual charge on cell from Monday. \nDec 5th 12:45 AM: They said the water levels are manageable and few shops are open along Radhakrishnan Road.\nDec 4th 12:15: Sridevikuppam main road- water reduced greatly and Kamakoti Nagar -no water logging There is intermittent power, no mobile signal\nDec 4th 10:00 am - Arcot Road has some flooding. \nDec 4, 08:00 am - Chinmaya nagar (near velankanni school) : Able to commute from Chinmaya nagar to Valasaravakkam and back without issues. Water has receded significantly on main roads. Power restored in Chimaya Nagar. No power in Valasarawakkam. Cell networks still spotty. Prices for milk / supplies marked up significantly\nDec 4th, 4.45am - Valasaravakkam and Alwarthirunagar: water levels are slowly reducing. Power is yet to resume in most parts due to stagnant water. \n","","","",""],["VANDALUR","","","","","",""],["VANAGARAM","","","","","",""],["VELACHERY","Dec-04 14:00","Dec 4th 14:00  – Most people from vijaynagar rescued. Still water logging slowly receding and no power\nGangai nagar evacuated and secured. Armed forces have taken over, volunteers restricted entry into vijayanagar from madippakkam side.\nDEC 3rd 4:40pm : \nDry Areas : Velachery Bye Pass road. Area from phoenix mall up to murgan kalyana mandapam clear of water. Gangai Nagar, Sakthi vijayalakshmi nagar, natesan nagar etc. \nWater logged: Buvaneshwari Nagar 2nd Main road, behind Chennai Silk","","","",""],["VELACHERY","Dec-05 14:00","Erattai Pillayar Koil Street(Near Sai Skanda Real Val homes) has water receding, and had about knee deep water this morning\nDec 5, 2pm: entrance to main road , one tree fallen - ankle length water- traffic can navigate; Velachery, Seethapathy Nagar - power restored , no water logging.","","","",""],["VILLIVAKKAM","Dec-03 15:00","Manageable flooding near New Avadi Road. Power is available and essential stores are open","","","",""],["VIRUGAMBAKKAM","Dec-05 05:00","Virugambakkam, near Arcot road pizza hut, reddy street are safe. We have power supply, no water logging and mobile networks here.\nJains and Ceebros water is ankle-length.","Power restored","","",""],["VIRUGAMBAKKAM","Dec-04 11:00","AVM avenue 4th street and Sanjay Gandhi Nagar - water logging in inside streets little worse than on main road which has got 2-3 feet water but vehicles plying","","","",""],["WEST MAMBALAM","Dec-05 04:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686556258224965/\nDec 6th 12:55 PM- Janaki Nagar, Power full on, airtel and landlines working, some water logging                                                                                                                                    Dec 5th 3:45 AM : VALASARAVAKKAM BSNL tower just came back on. Dad had residual charge on cell from Monday. \nDec 5th 12:45 AM: They said the water levels are manageable and few shops are open along Radhakrishnan Road.\nDec 4th 12:15: Sridevikuppam main road- water reduced greatly and Kamakoti Nagar -no water logging There is intermittent power, no mobile signal\nDec 4th 10:00 am - Arcot Road has some flooding. \nDec 4, 08:00 am - Chinmaya nagar (near velankanni school) : Able to commute from Chinmaya nagar to Valasaravakkam and back without issues. Water has receded significantly on main roads. Power restored in Chimaya Nagar. No power in Valasarawakkam. Cell networks still spotty. Prices for milk / supplies marked up significantly\nDec 4th, 4.45am - Valasaravakkam and Alwarthirunagar: water levels are slowly reducing. Power is yet to resume in most parts due to stagnant water. \n","","Thiruvengadam Street","Station road, Babu rajendra prasad st near madley subway, 4-5 ft of water",""],["WEST MAMBALAM","Dec-05 04:00"," https://www.facebook.com/groups/ChennaiFloods/permalink/1686557711558153/\n Dec 05, 4 AM:  No current , Network is available for airtel alone in few places, Water logging below knee level, all the provisions are accessible\n Postal colony bus stop ankle length water, navigable.\n Karnan st, Bhaktavatchalam st navigable\n Jubilee road drained\n","","","",""],["THIRUVANMIYUR","Dec-04 16:30","Waterlogging but people are safe. No power or network","No power/network","","","https://www.facebook.com/groups/ChennaiFloods/"],["SHASTRI NAGAR","Dec-04 16:55","power supply restored","power restored","","","https://www.facebook.com/groups/ChennaiFloods/"],["ADYAR","","sivagamipuram - power restored","power restored","","","https://www.facebook.com/groups/ChennaiFloods/"],["VIRUGAMBAKKAM","","Water levels receding. Power restored in some areas but phone lines are down","Power restored/no network","","","https://www.facebook.com/groups/ChennaiFloods/"],["ADAMBAKKAM","Dec-04 13:00","RT #Adambakkam Main Roads r clear of Water, interiors water logged. Autos plying btwn Velachery and Adambakkam. Food, Water supply is short","","","",""],["THORAIPAKKAM","Dec-04 16:00","Jain Housing near bridge - flooded but people are being rescued by boats. ","","","",""],["PERAMBUR","Dec-04 14:00","Dry areas (little or no water): Paper Mills Road, Madhavaram high road, Moolakadai junction, Perambur main road to Madhavaram junction\nAreas still waterlogged: Jawahar Nagar, Muthumai nagar, Periyar Nagar, Ponniyamman medu, MR Nagar","","Paper Mills Road, Madhavaram high road, Moolakadai junction, Perambur main road to Madhavaram junction","Jawahar Nagar, Muthumai nagar, Periyar Nagar, Ponniyamman medu, MR Nagar",""],["NOLUMBUR","Dec-04 17:45","Near VGN MInerva Apts - No water logging. Power restored and intermittent Vodafone network Airtel networks work better","Power restored/intermittent phone network","","","First hand info"],["PALLAVARAM","Dec-04 16:00","Dec 4, 4.00pm:Near Inayath hall, Water has receeded.","No power till now","","",""],["ASHOK NAGAR","Dec-05 04:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686557711558153/\nDec 5, 4 AM.  No current and no network in almost all the places. Very minimal water loggings, provisions are already there for people,Most of the shops are accessible.\nArea back to normalcy. Everybody is getting food and water. Some people cooking in their own houses","","","",""],["KKNAGAR","Dec-04 18:00","Area is mostly back to normalcy. Everybody is getting food and water. Some people cooking in their own houses. CWPD Quarters is fine.  Bharatidasan Colony is still affected - need to mobilize resources for food and water, although nearby people are providing some help. But people are safe, and old people needing medical attention have already been taken to hospital","","","",""],["SALIGRAMAM","Dec-04 18:00","There is still some water stagnation. ","","","",""],["VALASARAVAKKAM","Dec-04 18:00","water is knee level and receding. we are looking to mobilize resources for food and water.","","","",""],["ALWARTHIRUNAGAR","Dec-04 18:00","water is knee level and receding. we are looking to mobilize resources for food and water.Balaji nagar,Alwarthirunagar - Water is around 1.5 feet. shops have also opened.","Dec 4, 10:00 AM - Phone lines are down...both landline and cell phones. ","","",""],["VIRUGAMBAKKAM","Dec-04 18:00","There is still some water stagnation. Jains ashraya apartments in vembuli Amman koil street is damaged till ground floor and people have been moved to the upper floors and nearby safe places. ","","","",""],["SALIGRAMAM","Dec-04 18:00","Kambar Street and 1st Main Road near Vinayagam Ave- Both places have knee-deep water still, although it seems to be receding. They had some heavy intermittent showers but nothing too bad. Power is intermittent (was on for a few hours yesterday and just came now; enough to charge phones). ATMs dont have any money. Medical shops are open. Not navigable by motorbike, though.","","","",""],["THORAIPAKKAM","Dec-04 18:00","However, the main road is relatively clear of water. IN some areas with water, people are safe if they stay put at home. People commute by boat between apartments. .  Karapakkam is still a little flooded. ","","","",""],["ABHIRAMAPURAM/ALWARPET","","Foreshore Estate Airtel office to Park Sheraton full straight is motorable. Water logged from Kaliappa to Park Sheraton","","","","https://twitter.com/rj_manutd/status/672770665171181569"],["NUNGAMBAKKAM","Dec-04 19:00","Waterlogging on santhome high rd (near hotel palmshore) & one lane in Nungambakkam high road till Gemini for 300 yards. Chetpet bridge made two-way.","","","",""],["ADYAR","Dec-04 18:00","Karpagam gardens: Landlines working for the past 2 hours, Occasional cell phone (mostly vodafone) signal from terrace. Water has been receding and pumped out occasionally until noon or so. Intermittent rains/ heavy rains in the afternoon for 20 mins.  Adyar area would get power for 2 hours only once the water logging is at safe levels","","","",""],["BESANT NAGAR","","Near Ashtalakshmi temple area: Water has been receding and pumped out occasionally until noon or so. Intermittent rains/ heavy rains in the afternoon for 20 mins. ","","","",""],["RAMAPURAM","Dec-04 18:00","Asvini Atrium water completely drained, traffic has resumed on Valluvar salai.","Working scarcely and intermittently. Keep trying until you gain contact.","","",""],["ADYAR","Dec-05 23:17","Kasturba Nagar 4th and 5th Main Road have 2ft water. sewage water has mixed with rain water and entered many houses in our neighbourhood.hired pvt motors","Power is on.","","","https://twitter.com/ajit_bhaskar/status/672754805463379968"],["KKNAGAR","Dec-05 20:30","On ground live update - Near PSBB and Lakshmanasamy Salai - very little water on road. Heavy rains let up, but still drizziling right now\nDec 5 8:30 pm - MGR Nagar near Data Udupi bus stand, conditions good. No water logging.","power there since yesterday, low voltage, phone networks still poor\nDec 5 8:30 pm - Power not yet up in MGR nagar","","",""],["PADUR","Dec-04 18:07","Roads towards Thiruporur not motorable for small cars due to some damage near Thayyur. Only CVs can go","","","",""],["CHOOLAIMEDU","Dec-04 18:06","Waterlogging up to 3 ft, mixed with sewer water.","","","","https://twitter.com/rakeshkhabiya/status/672756425412636672"],["T.NAGAR","Dec-04 18:17","IDBI Bank ATM on Dr. Nair Road and Syndicate Bank ATM opposite Residency are working.","","","","https://twitter.com/AidOffered/status/672759140821934081"],["VILLIVAKKAM","Dec-04 18:17","Almost no water logging on the roads, except at the Bus Depot. Normal traffic right now.","","","","https://twitter.com/ChennaiRainsOrg/status/672759612345442304"],["EKKATUTHANGAL","Dec-04 18:28","All retired defence personnel have been rescued and housed in the Military hospital. All civilians in the area are in Cantonment Centre in St. Thomas mount.","","","","https://twitter.com/ChennaiRainsOrg/status/672761873821908992"],["PALLAVARAM","Dec-04 18:40","Roads are motorable up to Vels University.","","","","https://twitter.com/ChennaiRainsOrg/status/672764993738137600"],["THIRUVANMIYUR","Dec-04 21:33","","Power restored in parts of the area near Shankara colony","","",""],["BESANT NAGAR","Dec-04 21:33","","Power restored in Besant Nagar, Rukmini Road, and nearby areas.","","",""],["PAMMAL","Dec-04 21:43","Is back to normal. Only petrol is on demand","","","",""],["ALWARTHIRUNAGAR","Dec-04 13:30","Lamech school road area all fine","Some cell towers working. Power yet to come.","","",""],["VELACHERY","Dec-04 21:50","Electricity restored, no network connectivity yet.","Power yes, phones not yet.","","",""],["ASHOK NAGAR","Dec-04 22:00","f47th street, 9th avenue - raining on and off, no stagnant water on 47th street, but no power and bad network.","No power / bad phone signal","","",""],["VALASARAVAKKAM","Dec-04 22:30","Area near 108 majestic colony - people are safe ","","","",""],["PALAVAKKAM","Dec-04 18:30","No water stagnation, roads dry. Shops open. Seems safe.\nTelephone connections (BSNL landline) intermittent.","Power not up. Since one of the supply boards is in contact with stagnated water - power may not be up till Monday. Mobile networks seem to work, but no electricity.","","",""],["ROUTE: BANGALORE TO CHENNAI","","5 Cars have made it to Bangalore via Chetpet - Aminjikarai - Poonamallee. The road till Bangalore is dry. Sriperambadur and Kanchipuram are not flooded! Take the Parry's - Central and reach Chetpet, cross Anna Arch and stick to the highway. Stay close to the median in case they are clogged. All the buses are running from Koyambedu","-NA-","","",""],["ROUTE: KANCHIPURAM_KOYAMBEDU","","The road is quite good. There are areas that have potholes, but no water logging at all","","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-04 10:00","Porur signal is free to vehicular traffic since morning","","","",""],["SALIGRAMAM","Dec-04 22:00","Rajaji Colony - all seems fine. Power and phone connectivity stil bad, but safe for now.","Power, phone situation still bad. But area is safe.","","",""],["TEYNAMPET","","Roads clear from Eldams road till Adyar","","","",""],["ARUMBAKKAM","Dec-04 22:35","Not more than ankle high water, no one stuck anywhere","No power","","",""],["ROUTE: KOTTURPURAM BRIDGE","","Bridge closed, do not use","","","",""],["ROUTE: Billroth Hospital signal to Music College via Mylapore","","no problem except for a bit of water logging near the playground next to Music College.","","","",""],["ROUTE: Greenways Road signal to Boat Club area","","water logging on the stretch","","","",""],["NAVALUR","Dec-04 23:00","No waterlogging, situation seems good","Power coming back, Internet coming back in parts too","","",""],["ROUTE:Perungudi","","Toll plaza motorable","","","",""],["ROUTE: TTK Road signal to RA Puram","","no problem, but a bit of water logging near Billroth Hospital.","","","",""],["ROUTE: Adyar signal to Thiruvanmiyur signal","","no problem","","","",""],["ROUTE: Adyar Bridge","","no problem, but the Adyar Flyover is closed.","","","",""],["ROUTE: Routes to OMR","","heavy water logging towards Buckingham Canal AND towards Tidel Park SIGNAL (basically the only 2 options to reach the OMR)","","","",""],["ROUTE: #‎MCITY‬ TO ‪#‎GUINDY","","the roads are clear. No water logging and moving traffic. Shops are open.","","","",""],["ROUTE: Mylapore to T Nagar","","along TTK Road, Eldams Road, Nandanam: 2-3 feet of water, advised not to travel there.","","","",""],["ROUTE: Koyembedu flyover to Chetpet Bridge","","Absolutely no problem on the roads.","","","",""],["ROUTE: Chetpet Bridge to Gemini","","again, no problem, except for a bit of water logging on Nungambakkam High Road.","","","",""],["ROUTE: Gemini to TTK Road signal","","no problem.","","","",""],["ROUTE: Post OMR","","Perungudi toll Plaza motorable","","","",""],["ROUTE: From City towards ECR","","Turn left towards thiruvanmiyur...there are pockets of waterlogging but motorable","","","",""],["VELACHERY","Dec-04 23:50","Dandaneeswaram Nagar, no problems","","","",""],["KKNAGAR","Dec-05 00:40","R.K.Shanmugam salai, K.K. Nagar. Current has been restored.Waterr logging (knee level) near Double tank in R.K.Shanmugam salai.","Some landline working.","Areas around ESI, Sivan Park, Anna main road","",""],["NANDANAM","Dec-05 00:40","Areas in and around 10th street, bajaj apartments, Nandanam - dried up with only patches of water here and there. It did rain heaily between 2 and 6 PM but that has no effect on the situation. Also near new tower block and 4th street water has drained down to ground level. Anna Salai also dried considerably.","Electricity/power is back up around 9.00 PM IST","10th Street, New tower block, 4th street, parts of Anna salai near nandanam","",""],["ANNA NAGAR/MOGAPPAIR","Dec-04 22:00","Shanti Colony: No water logging. power back. Some phone connectivity","","","",""],["VILLIVAKKAM","Dec-04 23:45","SIDCO Nagar 5ft water, corporation pumping out slowly.","","","",""],["PALLIKARNAI","Dec-04 22:40","Water around balaji dental college has about 3 feet of water","","","",""],["KOTTUR","Dec-05 00:30","Shops are open n some ATMs in #Kottur have started working. Cellphone networks are working fine too. Electricity is also back","Cellphone networks are working fine too. Electricity is also back","","",""],["VALASARAVAKKAM","Dec-05 00:30","close to Arcot road near Lamech School (Ceebros Park) water levels are manageable and few shops are open along Radhakrishnan Road.  shops are running out of essentials like mineral water and it's also very difficult to get milk and vegetables. The power is on and off, and mobile networks has started to function in the area.\nValasaravakkam -Kesavarthini area. Things are OK. Water logging is not bad. Essentials are available in the area.","Power connectivity is on and off. Spotty telephone connectivity.","","",""],["MADIPAKKAM","Dec-04 23:00","Dec 5,2015 9 am : Water logged near LIC nagar and madipakkam bus stand area, update from a friends mom staying in balaiya garden\nRAM NAGAR PICS : https://www.facebook.com/groups/ChennaiFloods/permalink/1686594064887851/\nRAM NAGAR SOUTH VIDEO : https://www.facebook.com/groups/ChennaiFloods/permalink/1686581211555803/\nRamnagar and Kuberan nagar still water logged but people have been well taken care of. Places until Ramnagar bus stop are dry, shops open. Water levels receding and should be completely drained by noon tomorrow, if no rains.","","","",""],["PALLAVARAM","Dec-05 00:30","No flooding in Zamin/old Pallavaram. \narea near dharga road is clear. \nMain bus stand in Pallavaram on the GST road has no water stagnation. ","","","",""],["VELACHERY","Dec-05 01:50","https://www.facebook.com/groups/ChennaiFloods/permalink/1686524618228129/\nTansi, Baby, Udayam and Ram Nagar flooded - 4ft water","","","",""],["GIRUGAMBAKKAM","Dec-05 00:30","Factory area. Water levels are receding on the ground floor. People are safe and there is food and water. ","Still poor connectivity, limited power. But safe.","","",""],["VIRUGAMBAKKAM","Dec-04 23:00","vembuliamman koil street, virugambakkam - spoke to police commisioner - water logging still there - but is coming down fast and should be done by noon.","Power out still due to water logging, but people safe. Mobile networks down.","","",""],["ROUTE: CHENNAI TO BANGALORE","Dec-05 02:30","From thoraipakkam to Madhya kailash to guindy to porur - Bangalore highway. Crossing vellore now.. Except porur, water completely drained out from the roads. Porur only 1ft water . outside porur little showers only from today evening. Friends were able to reach koyembedu through OMR. Saidapet buses , 19b Paris buses are operational. From kathipara to porur no tower signal. Its still in black box. ","Bsnl landline connections are getting restored in porur now. Ppl can listen to 104.8 who gives many information.","","",""],["VALASARAVAKKAM","Dec-05 03:45","","BSNL towers back on.","","",""],["RAMAPURAM","Dec-05 03:00","Park Dugar Area ok. Only power was lost. No significant water logging issues.","","","",""],["LIBERTY","Dec-05 04:00","Places in and around Liberty , Fathima convent has no problem they can access Spencer's daily and all the shops in station roads now. ","No network but current is there in most of the places.","","",""],["WEST MAMBALAM","Dec-05 04:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686594168221174/\nWEST MAMBALAM (Arya Gowda street, Postal colony, KV colony, Rangarajapuram,United colony,fathima convent) - No current , Network is available for airtel alone in few places, Water logging below knee level, all the provisions are accessible)\nAFFECTED AREAS - After raghavendra mandapam water close to knee level, No current, No network, Water cans and foods are already provided, People in the ground floor in streets Aziz Nagar, Subramaniam Nagar already vacated the place.","Aircel and BSNL Landlines working. Power available 2 hrs per day ","","",""],["ALWARTHIRUNAGAR","Dec-05 05:30","Just spoke to my mother in Alwarthirunagar. She, my uncle and aunts are all safe but marooned in their own little island. Cell phone keeps getting dropped but at least talked to her.","Mobile is up and down.","","",""],["ALWARTHIRUNAGAR","Dec-05 06:30","Power is back in alwarthirunagar .  Landline (BSNL) is not working. Stores are opened, still water on the streets.","Still issues with mobile calls, but mobile internet is working.","","",""],["TEST","TEST","","","","",""],["ALWARTHIRUNAGAR","Dec-05 07:51","Alwarthirunagar, Valasravakkam. Phone connections are getting restored in Valsaravakkam. But there is still water logging in the area..","","","",""],["VALASARAVAKKAM","Dec-05 07:50","Alwarthirunagar, Valasravakkam. Phone connections are getting restored in Valsaravakkam. But there is still water logging in the area..","","","",""],["VELACHERY","Dec-05 08:04","The interiors are still flooded and not accessible by normal vehicles. But there are lotta army men who access these areas with military vehicles supplying food, water and as much supplies as possible.","No power supply and no mobile network.\n","","",""],["VALASARAVAKKAM","Dec-05 08:04","Ashtalakshmi nagar, valasaravakkam. There is some water logging ","landline / cell is still down though.","","",""],["ADYAR","Dec-05 08:12","gandhingar 2nd main road near grand sweets, mild drizzle, sun peaking out, power there, milk, paper also being delivered","internet working landlines working.","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-05 08:30","Near arcot road is perfectly fine, can commute to and from Alwarthirunagar comfortably. All petrol pumps open but shortage of fuel supply. Petrol pumps near Poonamalee high road seem to have fuel supply and the road is perfectly fine. SRMC is open and functioning. Slight water logging in the area, nothing major.","No power supply and some cell phone towers are working\n","","",""],["NANGANALLUR","Dec-05 08:30","Drained of water, all clear.","Power is back, cell phone towers working","","",""],["WEST MAMBALAM","Dec-05 08:00","Water clearing away - Babu Rajendra Prasad street near mambalam station- ppl are safe. Shops are open but water still logged but receding.","BSNL working","","",""],["THILLAI GANGA NAGAR","Dec-05 09:30","Thillai ganga nagar subway has been drained totally and now open for traffic..people coming from airport or guindy can take this subway to move towards Adambakkam, Nanganallur, Madipakkam and Velachery","","","",""],["SAIDAPET","Dec-05 09:30","Saidapet, west jones road, near jeyaraj theatre\nthey have no signal or current yet but it is expected back soon. All water drained.","No power, signal. Expected soon.","","",""],["ASHOK NAGAR","Dec-05 09:30","47th Street - 1st hand report. All safe, lot of damage from ground floor level water. But all people safe, water has receded now.","Power back, BSNL landlines working.","","",""],["VELACHERY","Dec-05 09:30","Andal avenue, gandhi road Velachery - all safe. Power back, phones working.","Power back, phones working.","","",""],["WEST MAMBALAM","Dec-05 09:51","Govindan Road still flooded","","","",""],["THIRUVANMIYUR","Dec-05 09:55","Kalakshetra road has still knee level water. Not advisable to take the route via Besant nagar to thiruvanamiyur. BSNL is working","No power/electricity","","",""],["VIRUGAMBAKKAM","Dec-05 10:00","All areas waterlogging seems to have gone, it is back to being fully safe. Power back, phone still down","Power there, No networks yet.","","",""],["PERUNGUDI/KANDANCHAVADI","Dec-05 10:00","Power is back","","","",""],["KKNAGAR","Dec-05 10:14","BSNL is back","BSNL working","","",""],["ASHOK NAGAR","Dec-05 10:14","BSNL is back","BSNL working","","",""],["WEST MAMBALAM","Dec-05 21:30","BSNL is back across Mambalam; Balakrishnan Street specifically (behind Ayodhya Mandapam), power also restore","BSNL working, power back","","",""],["VELACHERY","Dec-06 12:05","Bhuvaneshwari nagar 2nd main road (behind Chennai silks) ‪#Velachery‬ is safe.\nHowever bhuvaneshwari nagar (behind Chennai silks) is still stagnant with hip deep water. Also rescue team from pudhiya thalaimurai etc had reached the place and distributed milk n food. ","","","",""],["MADIPAKKAM","Dec-05 10:55","Ram nagar main road 1-7 are now drained out and ground floor houses have drained out. Buses are plying from main road 45N... 8th main and beyond still has about knee level water and so is north extension interiors.","Dec 5 pm: LIC Nagar 4th Main Madipakkam - power is back","","",""],["KKNAGAR","Dec-05 11:00","PT rajan salai upto double tank motorable & from there on inside KK Nagar people are stepping out and even milk vans are supplying. Water level upto 1 ft.","","","",""],["TESET","TEST","TEst","","","",""],["GUINDY","Dec-05 11:00","Industrial Estate left: people stuck earlier - all cleared now. Accessible now, no waterlogging.","","","",""],["ROUTE: Manapakkam to Porur Road","Dec-05 11:00","Kathipara is completely open and safe. From kathipara went right towards manapakam to porur road. Zero water stagnation and the bridge near MIOT is open with water levels under the bridge pretty less not anywhere near the top of the bridge.  L&T/DLF completely dry and accessible.","","","",""],["ALWARTHIRUNAGAR","Dec-05 11:00","Water is draining very slowly in Balaji Nagar and surrounding streets. Milk and other essentials are being delivered near alwarthirunagar main road. Public transportation have resumed services.","Very poor cell phone coverage and power is not restored yet.","","",""],["PALLIKARNAI","Dec-05 12:00","National Institue of Ocean Technology (NIOT) is under the armed forces, not accessible by vehicles","","","",""],["MADURAVOYAL","Dec-05 08:00","Route from cmbt to poonamalle high road or maduravoyal is blocked. heavy traffic.\nVehicles are stranded past one hr and moving in every possible direction. 8th St, 4th Blk, evrythng s normal now but, tel network is down","No phone lines still","","",""],["INJAMBAKKAM","","People stuck in the inner lanes opp kailash resort. People are in their houses. There are boats and teams that come to the main road to ferry food and stuff.\n","No phone lines or power","","",""],["KODAMBAKKAM","Dec-05 12:25","No power, No ATM's either. Indian Oil petrol pump beside Meenakshi College is open on Arcot road","","","",""],["THIRUVANMIYUR","Dec-05 12:08","Power is back in Kottivakkam Kuppam road, Valmiki nagar","","","",""],["KODAMBAKKAM","Dec-05 12:00","Ankle lever water - Ragavendra mandapam, Saamiyar madam, Rangarajapuram near More supermarket, Five lights, Umapathy street, Power house to bridge, Vivek's flyover (it's open two-way)","","","",""],["KODAMBAKKAM","Dec-05 12:50","Kodambakkam high road, safe","","","",""],["NUNGAMBAKKAM","Dec-05 12:50","Sterling Road College Road, safe","","","",""],["TRIPLICANE","Dec-05 12:50","Marina Beach Road are safe ..","","","",""],["VELACHERY","Dec-05 13:00","Velachery AGS colony power back. Mobile connection back. Water receded.","Phone lines, power restored","","",""],["EGMORE","Dec-05 13:15","Ethiraj College road dry, Haddows road free drive.","","","",""],["PALLAVARAM","Dec-05 11:20","No water stagnation, some shops open supermarket open(Reliance fresh and More market)","","","",""],["ROUTE: Routes to OMR","Dec-05 13:00","OMR from Navalur to Madhya Kailash is pretty dry","","","",""],["KKNAGAR","Dec-05 13:15","Power restored.Airtel and BSNL mobile phones are reachable.","Power restored.Airtel and BSNL mobile phones are reachable.","","",""],["ROUTE: Vadapalani to Manapakkam","Dec-05 13:53","Route: Arcot Road, 100ft road, Jawaharlal Nehru salai, Kathipara fly over, Poonamalee road, Manapakkam main road. Route till Manapakkam signal is good. Roads are bit damaged in Manappakam main road. Road has caved-in in one of the section, so the road is narrow. Water level has receded a lot in main areas.","","","",""],["MADIPAKKAM","Dec-05 14:10","Madipakkam, ponniamman kovil street. Not much rain today. Water has not been high in this streets. Milk and veggies are available. But a long queue.","Power is 50% time up. No mobile network yet. BSNL landline is working. ","","",""],["THORAIPAKKAM","Dec-05 13:00","Main roads dry, inroads still flooded to about waist level water although apartments are alright.","Apartment with generators get about 6 hours power everyday. Otherwise, power and mobile network still down","","",""],["VELACHERY","Dec-05 14:00","TNHB Colony is very safe. Inside 4th Avenue water is receeding but not fully drained out. Nothing serious here. Power is also back on now. Network should be back soon","Power is back. Netwrok should be back soon. ","","",""],["VEPERY","Dec-05 14:10","Bains Baptist school. Plenty of food supply available, in 100,000 numbers. Continuous cooking. Volunteers pl collect and distribute SACHIN R MEHTA 98400 5757","","","",""],["KODAMBAKKAM","Dec-05 14:40","Rangarajapuram has water logging but only in few stretches.. Kodambakkam - water level a have come down to a minimum.. All shops are open and people are starting to come outside in all these areas.. There is still no power in most of the streets in the above mentioned areas.. Mobile connectivity is sporadic and u might get connectivity if u move out to terrace, outside ur house or nearby streets #chennairains","No power, sporadic cell signals, no landlines","","",""],["SAIDAPET","Dec-05 14:00","Area is good. Cars going around distributing food and water. Aranganathan subway drained, expecting access to West saidapet soon","","","",""],["KODAMBAKKAM","Dec-05 14:00","WORKING ATM INFO - Bank of Baroda, opp Spencers Daily. SBI near Liberty theatre","","","",""],["SAIDAPET","Dec-05 14:45","sarathy. nagar west saidapet. Near by landmark is jaferkhanpet and saidapet sudukadu . This places are the low lying areas in saidapet and this location is perfectly all right. All are safe.\r\n\r\nFollowing murahari salai, punniya kodi st and the two more streets in that line is also all right.","","","",""],["SAIDAPET","Dec-05 14:45","parsn nagar -- Ground floor fully water yesterday full water drained,parsn people everybody safe\nKamatchipuram 1st street 3 ft water, being pumped out now\nWest Jones road- amber apartments nearby they r able to get everything nearby.shops r open.and water receded...no worries as f now","","","",""],["WEST MAMBALAM","Dec-05 14:00","WORKING ATM INFO - SBI near Bakya fast food","","","",""],["WEST MAMBALAM","Dec-05 14:00","waterlogging to a considerable height of 2-3 feet","no power, no mobile network yet","","",""],["VIRUGAMBAKKAM","Dec-05 13:00","padmavathy nagar water below knee level. Everyone safe; Sanjay Gandhi nagar, Elango Nagar - Water almost receded, power back but no communication lines","No Power. no communication lines yet","","",""],["THIRUVANMIYUR","Dec-05 15:00","Rajaji nagar main road, Power is back on but fluctuating. Decent connectivity, ankle high water.","Fluctuating/Decent","","",""],["MADIPAKKAM","Dec-05 14:00","Ramnagar South - Water levels receding, knee level or less. Careful walking advised. Sadasivam nagar is clear","","","",""],["RAMAPURAM","Dec-05 15:15","SRM Dental College road clear","Aircel is working","","",""],["MADIPAKKAM","Dec-05 15:30","Kuberan nagar extension is flooded main toad ok","","","",""],["VANDALUR","Dec-05 15:30","Otteri and inside is good, with supplies and all. ","","","",""],["WEST MAMBALAM","Dec-05 15:30","Ayodhya mandapam all clear","","","",""],["MUGALIVAKKAM","Dec-05 15:30","Food is being distributed, NDRF and Army helping well. Not entirely accessible, heavy water flow","","","",""],["CHEMMENCHERY","Dec-05 15:30","Food and water distributed","","","",""],["PERAMBUR","Dec-05 15:40","ALERT - Electrical wires in the water, don't venture into it. Power has been shut down in most areas but some places wires are conducting. Streets name - Bharathi street, madurai street,vadivelu all cross street) near bus depot. ","","","",""],["VELACHERY","Dec-05 16:30","Ram Nagar and Muruga Nagar- The whole ground floor is flooded some ppl still stuck in buildings. being provided with food and water","","","",""],["MADIPAKKAM","Dec-05 15:00","The madipakkam main roads are perfectly fine. Bone dry. Just that areas near the water bunds arent accessible after a certain point. Power restored at around 11 am at madipakkam only certain areas.","","","",""],["KODAMBAKKAM","Dec-05 17:30","Little water logged near Ambedkar statue. Few buses from Vadapalani in operation","Vodafone and Aircel working","","",""],["NESAPAKKAM","Dec-05 17:45","Power is back ","","","",""],["KOTTURPURAM","Dec-05 18:00","Kottupuram bridge is still shut. from signal under cenotaph road bridge till french loaf / citibank atm. .\r\nThey are pumping out water and road is damaged\r\nMight be tomorrow till they let people across\r\nHousing board road is dry, garbage mostly\r\n1st street and all water being pumped out\r\n2nd street dry but no power and limited phone signals","no power. limited phone network","1st stree and 2ns treet","",""],["ROUTE: Chetpet Bridge to Gemini","Dec-05 18:00","The area near THE PARK is waterlogged with knee level water. Two wheelers not advisable","","","",""],["WEST MAMBALAM","Dec-05 14:00","Water logged from station onwards in nearby streets -little below knee level. Some sewage water outflows too..causing contamination...Help needed to clear the water. .Not many shops open on W.Mambalam station side. Ranganathan street many shops were trying to open and cleanup. no power in this area as of this afternoon.","","","",""],["PERUNGUDI/KANDANCHAVADI","Dec-05 17:50","Kuppam area - place still has significant water stagnation. Today some of them were able to get back to their house since water receded but still majority's house is still under water. They are housed in schools, temple and marriage Hall. No major aid here, and they are getting food and clothes from nearby houses. BUt no major volunteer groups are headed here. ","","","",""],["EKKATUTHANGAL","Dec-05 18:30","power is back. Vodafone signal is available but patchy.","","","",""],["ST THOMAS MOUNT","Dec-05 18:30","power is back. Vodafone signal is available but patchy.","","","",""],["VELACHERY","Dec-05 18:40","Power and landlines up in Rajalakshmi Nagar.","","","",""],["VIRUGAMBAKKAM","Dec-05 19:30","Mega mart, Arcot road - Milk supply available cheaply.","","","",""],["ROUTE: AMBATTUR TO THIRUVERKADU","Dec-05 18:30"," Ambattur to Kaduvetti via Thirumullaivoyal, Ayapakkam, Veeraraghavapuram (Avadi) all motorable. Ayapakkam has potholes though. Avadi to Maduravoyal is blocked as the Avadi bridge fell so you can go via Thiruverkadu (Paruthipattu route). Thiruverkadu to Maduravoyal near Ayanambakkam road is blocked as lines are beign restored.","","","",""],["IYAPPANTHANGAL","Dec-05 20:40","Power isn't back for most parts, water levels have receded to knee level almost everywhere. Isolated cases of hip level water. Mobile networks not functioning, except BSNL in some parts. ","BSNL only in some parts","","",""],["MANAPAKKAM","Dec-05 19:45","Update from marvel river view county. Water receded. Power restored. They were able to venture out to the main road","","","",""],["VIRUGAMBAKKAM","Dec-05 19:15","Areas near chandra metro mall is water logged. Invisible and bad. Do not venture out with two wheelers. Lambert nagar and vembuliamman koil street with knee level water","","","",""],["ALWARTHIRUNAGAR","Dec-05 20:15","Gandhi Rd-Power back but no phones- cell or landline. ACT connection is working. water logging in interior part of Gandhi Rd. shops closed but milk and vegetables available.. Situation ok. ","","","",""],["MUGALIVAKKAM","Dec-05 19:00","Kundrathur main road is motorable, can reach Madananandhapuram safely","","","",""],["VYASARPADI","Dec-05 20:35","Basin Bridge Route motorable from one direction ","","","",""],["T.NAGAR","Dec-05 20:50","Potholes on N. Boag Road. No power, complete darkness. Drivers avoid\naccessible from Kasi Arcade only. Ankle-deep water at GN Chetty Road end.","no power","","",""],["ADYAR","Dec-05 20:50","Gandhinagar- power up, landline and cell working, internet working, light drizzle.","power, networks internet all working","","",""],["T.NAGAR","Dec-05 21:50","North Usman Road, from viveks towards mahalingapuram bridge,  Ankle-deep water. Motorable","","","",""],["PORUR POONAMALLE / POONAMALEE HIGH ROAD","Dec-05 21:55","Power back in all parts of sakthi nagar. Landline & Airtel functional.","Power, landline and Airtel working ","","",""],["ROUTE: Sriperumbudur to Madipakkam","Dec-05 20:00","Roads clear from Sriperumbudur to Poonamallee to Porur to Guindy to Madipakkam via St.Thomas Mount subway","","","",""],["ADYAR","Dec-05 22:10","Petrol and diesel available in bunk near malar Hosp. Open till 11 pm.","","","",""],["ABHIRAMAPURAM/ALWARPET","Dec-05 22:00","TTK Rd, Eldams Rd, Bharathidasan Rd, Seethammal Colony waterlogged. Pumping underway.","","","",""],["VIRUGAMBAKKAM","","natesan nagar, kaliyaman koil st, most parts of saligramam are fine. Water here and there maybe, but all motorable. \nOne side of arcot road is functioning. Vembuliamman koil street is v bad. Hip level water, no power, no network. It looks like a lot of people have moved out, but whoever is still present definitely need help. ","","","",""],["WEST MAMBALAM","Dec-05 22:20","Elliamman Kovil street and adjacent streets have shin-knee level water.","Power restored","","",""],["KOYAMBEDU","","Koyembedu is fine and a policeman told me that buses to all places are running. Local Buses (free - no ticket now), auto, share auto running, most shops opened etc. ","","","",""],["VELACHERY","Dec-05 21:40","Power restored on both sides of 100 Ft Rd Velachery","Power restored","","",""],["WEST MAMBALAM","Dec-05 22:30","West Mambalam, near Ayodhya Mandapam Pillayar kovil -The area is limping back to normalcy. ","They have power, network and landline. No cell phone coverage yet. Whatsapp is the best way to get in touch.","","",""],["PUDUPET/CHINTADRIPET","Dec-05 22:30","Sewage water stagnating everywhere","","","",""],["VIRUGAMBAKKAM","Dec-05 23:45","Near Avichi school- Water has receded well. Roads are functional from big bazaar though there still is a lot of water(Ankle deep) near chandra mall along with a ton of potholes(Bikers beware!). roads should back to usable condition if it does not rain tomorrow.","Power is back near avichi school and sathya garden.","","",""],["PERUNGUDI/KANDANCHAVADI","Dec-06 00:30","Perungudi, no flooding on omr outside Perungudi, but inner roads some are ok, some are bad","still no power and no network. ","","",""],["ROUTE; T.NAGAR TO MAMBALAM","Dec-06 00:30","Only one way to reach mambalam n kkn. GN Chetty road to Kodambakkam bridge to arcot road to ambedkar salai straight","","","",""],["MEDAVAKKAM","Dec-06 00:30","Ankle to knee level water in some areas. Relief workers get vehicle like ace to get in since lots of narrow streets","","","",""],["WEST MAMBALAM","Dec-06 00:50","Mambalam Kamatchipuram 1st st light - Most of the water pumped out.","","","",""],["MANNIVAKKAM","Dec-06 01:20","No waterlogging in mannivakkam around the Serene Adinath building. Power up but mobile connections & landline patchy.","Power up. Mobile/Phones still up and down.","","",""],["ALWARTHIRUNAGAR","Dec-06 01:20","Near VV Giri street: water mostly receded. Not sure of landline/power mobile patchy.","Mobile patchy; Power up in some places.","","",""],["VALASARAVAKKAM","Dec-06 02:20",". Road adjacent to Valasaravakkam Mega mart has been blocked due to heavy water log.","No power as yet","","",""],["VIRUGAMBAKKAM","Dec-06 06:54","Rains on and off.","Power is on","","",""],["MYLAPORE","Dec-06 06:54","Heavy rains have commenced; TTK Salai in particular.","","","",""],["AIRPORT","Dec-06 06:54","Terminals are being opened for departing flights.","","","",""],["WEST MAMBALAM","Dec-06 08:54","Power is back on","","","",""],["BESANT NAGAR","Dec-06 09:10","Besant Nagar - no prob. All fine. It's raining now but till yesterday shops were open.","","","",""],["ROUTE; Tambaram to Velachery","Dec-06 09:30","roads from tambaram to velachery is motorable. roads near Pallikaranai police station is narrow and has huge potholes. buses ply between tambaram and Medavakkam. Alternatively use Tambaram > Medavakkam coot road > Kovilambakkam > Kamakshi hospital > Velachery.","","","",""],["VELACHERY","Dec-06 09:30","towards Padmavathy Nagar(& ram nagar Extn) .. All roads okay, power restored as well","power restored","","",""],["BESANT NAGAR","Dec-06 09:30"," in Sriram nagar.. There water was hip deep- but relief boats reaching with material","","","",""],["ROUTE: Kelambakkam to Bangalore","Dec-06 09:50","Kelambakkam to Bangalore today.Vandalur road water logged but motorable. Outer Ring Road good and Poonamallee road till Kancheepuram not too bad - potholes are there but can maintain decent speed. Raining heavily now.","","","",""],["AMINJIKARAI","Dec-06 10:15","aminjikarai normalcy returns in aminjikarai NM road PH road.All ATMs shops fuel pumps functional","","","",""],["PERUMBAKKAM","Dec-06 10:15","Vodafone signal is up - though not strong in the Perumbakkam area","","","",""],["ROUTE: Koyembedu to Guindy","Dec-06 10:30","Mostly clear. Small stretch with water. Just before ambica empire","","","",""],["ROUTE: Kelambakkam to Bangalore","Dec-06 10:15","Road is good upto Vellore. Its cloudy here now but No rains. Around 200kms more to Bangalore. Not much of traffic on the road. There are buses plying on this route.","","","",""],["AIRPORT","Dec-06 10:15","very few flights are on from CHN to BLR. From Air India and Indigo.","","","",""],["KOVILAMBAKKAM","Dec-06 10:45","Moble networks working","","","",""],["WEST MAMBALAM","Dec-06 10:55","govindan road , lakshmi street post colony and all that surrounding areas . water and receded 95 percent and roads accessible ","","","",""],["NANGANALLUR","Dec-06 10:55","11:00 am Hindu Colony, Nanganallur also ok. Seems corporation staff flushed out drains 2 days back.\n \nNanganallur entirely clear.\n\nPower restored and constant rains, not heavy though. #Velachery #AreaUpdates\n","Power restored and constant rains, not heavy though. #Velachery #AreaUpdates\n","","",""],["ROUTE:viruddhachalam - kumbakonam - mayavaram","Dec-04 10:55","viruddhachalam - kumbakonam - mayavaram. Safe and motorable","","","",""],["MADIPAKKAM","Dec-06 11:35","Constant downpours in madipakkam surroundings.Area s clear to commute.. Expt kuberan nagar interiors,Ram nagar..","","","",""],["ADAMBAKKAM","Dec-06 12:05","Bhuvaneshwari Nagar, Saraswathy Nagar, Andal Nagar, Mahalakshmi Nagar water drained. Power restored","Power restored","","",""],["CHENGALPATTU","Dec-06 11:35","Waterlogging due to recent heavy rains","","","",""],["EKKATUTHANGAL","Dec-06 12:35","dlfitpark miot roads all clear.","","","",""],["KOTTURPURAM","Dec-05 22:00","no power no signal","","","",""],["EKKATUTHANGAL","Dec-05 22:00","no power no signal... not much water. no lights so not safe to travel at night.. fod packets reaching to ppl there","","","",""],["SAIDAPET","","Mellony road, thomas road- No power no singal... not safe to travel at night.. ppl have enough food and water. accessible theu vehicle","","","",""],["CHEMMENCHERY","Dec-06 12:45","People evacuated from here and are safe. ","","","",""],["TSUNAMI COLONY (OMR)","Dec-06 12:45","People evacuated from here and are safe. ","","","",""],["ROUTE: TTK ROAD TOWARDS SIET","Dec-06 13:15","Road blocked, due to accident and tree fall. cannot turn into SIET road. ","","","",""],["THORAIPAKKAM","Dec-06 13:15","OMR, Thoraipakkam - Pallavaram Road, Airport Road all fully operational. Self driven and checked ","","","",""],["ANNA NAGAR/MOGAPPAIR","Dec-06 13:15"," Sun is out","","","",""],["ADYAR","Dec-06 13:50","Power back in Raju st around arya gowda Road, From half way of arya gowda road until ayodhya mandapam and from Mahadevan St towards Ashok nagar","","","",""],["ROUTE: Kelambakkam to Bangalore","Dec-06 13:50","Krishnagiri -  Its cloudy but no rains here. Roads are excellent and no traffic on the road.\nThe roads from Krishnagiri to Electronic City are in good condition. Travelled in a regular car/sedan. The roads are in pretty good condition for the most part of the trip. The main challenge seems to be getting to Poonamallee from Chennai city.","","","",""],["WEST MAMBALAM","Dec-06 13:50","Power back in Raju st around arya gowda Road, From half way of arya gowda road until ayodhya mandapam and from Mahadevan St towards Ashok nagar","","","",""],["VALASARAVAKKAM","Dec-06 14:00","13 mins ago -- hospital road\r , Behind jai garden bus stop\r. Next stop after valsaravakkam towards porur. -- There is no water in the flats now. Phones are working, cellphone connection is spotty. Water level is receding","","","",""],["T.NAGAR","","Pondy bazaar petrol pump is accessible. All stores like Nalli are open but can't swipe cards. Avoid TP road, Bazullah road, Habibullah road and GN Chetty road, still water logged","","","",""],["ROUTE: Chennai to Coimbatore","Dec-06 14:00","chennai - cbe route : Vellore route. Salem - darmapuri - Krishna giri - vellore - poonamallee. I know someone that travelled on Friday.","","","",""],["ROUTE: Kovalam to Kelambakkam","Dec-06 14:30","Kovalam-kelambakkam Rd has collapsed,","","","",""],["ADYAR","Dec-06 15:30","LB road good to use, Indian Bank ATM is loaded and open to use.","","","",""],["PORUR POONAMALLE / POONAMALEE HIGH ROAD","Dec-06 15:57","Porur No rain. Power was up for 30 mins in Sakthi Nagar. Seeing BSNL,Airtel/Cel,Vodafone,Idea signal","","","",""],["ROUTE: Porur to KKN","Dec-06 16:00","Road from KKNagar to Porur via AshokNagar OlympiaTechPark is clear.","","","",""],["WEST MAMBALAM","Dec-06 16:00","Brindavan street n Doraisamy subway blocked.","","","",""],["PERUMBAKKAM","Dec-06 16:00","Perumbakkam Medavakkam - sholinganallur link road is open.Stretch near BharatiVidyalaya school is completely torn up.So travel 1 side only","","","",""],["TARAMANI","Dec-06 16:00","Taramani link road 95% clear, water stagnant at 2 places, but motorable.","","","",""],["PORUR POONAMALLE / POONAMALEE HIGH ROAD","Dec-06 16:00","Ponnamalee-mudravoyal-anna nagar-villivakkam. No rains. Water logging very little.","","","",""],["ANNA NAGAR/MOGAPPAIR","Dec-06 16:00","anna nagar. No rains. Water logging very little.","","","",""],["VILLIVAKKAM","Dec-06 16:00","villivakkam. No rains. Water logging very little.","","","",""],["VELACHERY","Dec-06 16:00","Velachery PhoenixMall roads are fine in 100ft road.","","","",""],["ADAMBAKKAM","Dec-06 16:00","Drive to guindy via link road is good but very bad potholes. HDFC and IndusInd bank ATM not working.","","","",""],["ADYAR","Dec-06 16:50","Entire Sardar Patel road, Adyar signal, Adyar bridge, RK Mutt road EXCELLENT ","","","",""],["ADYAR","Dec-06 17:10","Kasturba Nagar, Nehru nagar and Indira Nagar,Except Kb nagar 1st, 2nd, 3rd main and the 3rd cross street, most areas have water logging though ankle deep. These water stagnant areas are foul smelling and seem to have sewage mixed with it. Power is there in most places. Except for SB Travancore, nearby atm didn't have cash. Banks were open. Saw plenty of milk. No toor dal, moong daal in most stores. 3rd main is cordoned off for repair work near GKb opticals","","","",""],["KILKATTALAI","Dec-06 17:50","Road is waterlogged (ankle deep) between Kilkattalai bus stand & Grand Sweets. Drive safe.","","","",""],["PALLIKARNAI","Dec-06 17:50","Traffic due to water outside Jerusalem coll. Motorable","","","",""],["WEST MAMBALAM","Dec-06 18:05","Approach Road from Mambalam to Rangarajapuram still flooded. 6.05 pm.","","","",""],["PALLIKARNAI","Dec-06 18:30","roads fine and power available. Balaji dental college road not great but SUVs can drive.","","","",""],["RA PURAM","Dec-06 18:30","Absolutely superb roads . No rain. All clear","","","",""],["ROUTE:Medavakkam to Sholinganallur","Dec-06 18:30","Medavakkam toward Sholinganallur is open & traffic can move. Waterlogging receding.","","","",""],["PALLAVARAM","Dec-06 20:00","Both lakes on 200 ft road btwn Pallavaram & Kilkattalai are *FINE*. Smooth traffic in the area. Dont believe rumors.","","","",""],["ABHIRAMAPURAM/ALWARPET","Dec-06 20:30","Seethammal colony: There is still a fair bit of water logging. There are  machines pumping out water this evening and through the night. There is some significant seepage that is refilling the water which they pump out. They have brought sandbags to close the seepage and then the water should be removed after that.. estimates differ, but its likely it will be done in a day or two.","","","",""],["AIRPORT","Dec-06 20:00","Airport to resume full operations from Dec 7th, 6 am, including international flights","","","",""],["KOYAMBEDU","Dec-06 21:00","Roads clear at Koyambedu, traffic resumed as usual","","","",""],["GUINDY","Dec-06 20:30","Large parts of Guindy towards Saidapet and Mount road have no street lights and zero Vodafone signal. No rains.","","","",""],["CHEMMENCHERY","Dec-06 20:30","Adjoining lake and road at the same level with the water flowing over it. If it continues to rain overnight, situation could worsen.","","","",""],["ROUTE:Medavakkam to Sholinganallur","Dec-06 21:30","Route clear. But drive carefully. Too many pot holes. Buses started plying in the route","","","",""],["THIRUVANMIYUR","Dec-06 20:00","Thiruvanmiyur RTO Beach Roads motorable. Residents start seeing infections n swelling, mosquitoes frenzy","","","",""],["SITHALAPAKKAM","Dec-05 17:00","Water logging isn't an issue at all and power back. Phone lines are still down ","Power back, landlines still down","","",""],["ROUTE: SIET to Seethammal Colony","Dec-07 00:00","route from siet to seethammal colony - knee to waist deep water levels. Cannot wade through. There's a huge pit on the left side of the road post siet towards rapuram at seethammal colony. It's pitch dark out there. There's a barricade but the place is not cordoned off. No electricity. Not Easy to motor if you are unfamiliar with the location of pit. There's a random tree branch stuck there, perhaps as an indicator of danger. Avoid the stretch.","","","",""],["AIRPORT","Dec-07 00:00","Chennai airport gets nod for night operations, all flights to resume today - #TOI","","","",""],["VIRUGAMBAKKAM","Dec-06 00:00","Lambert Nagar area , School street, behind Vembuliamman koil , Virugambakkam and surroundings (behind CSI CHRIST CHURCH) are submerged with No sign of any authorities taking any steps or even pay visit the place to make efforts of draining the water. There has been No power since Tuesday noon and there is hip deep water on the road. This is just hardly 300 metres from Arcot road. My flat is in this area and I evacuated yesterday (6th December 2015). There are still minimum of 100 families around our flat, who couldn't step out and brave their lives in the sewage mixed water. Pls share this and bring to notice of govt officials to save this small stretch that has been neglected for the past week... You can contact me at 9884663577 (msg\\whatsapp\\facebook)..the map location (near to accurate is here...","","","",""]]}
